# Data Linkage

The title of the notebook should be coherent with file name. Namely, file name should be:    
*author's initials_progressive number_title.ipynb*    
For example:    
*EF_01_Data Exploration.ipynb*

## Purpose
formative asignements for 
## Methodology
naive combining data sets.
then blocking.
chekcing method efficiency using "reduction ratio"
## WIP - improvements
Use this section only if the notebook is not final.

Notable TODOs:
- group number of patients seen by LA_code;
- todo 2;
- todo 3.

## Results
Describe and comment the most important results.

## Suggested next steps
State suggested next steps, based on results obtained in this notebook.

# Setup

## Library import
We import all the required Python libraries

In [267]:
# Data manipulation
import pandas as pd
import numpy as np

# Options for pandas
pd.options.display.max_columns = 50
pd.options.display.max_rows = 30

# Visualizations
import plotly
import plotly.graph_objs as go
import plotly.offline as ply
plotly.offline.init_notebook_mode(connected=True)

'''import cufflinks as cf
cf.go_offline(connected=True)
cf.set_config_file(theme='white')'''

import matplotlib as plt

# Autoreload extension
if 'autoreload' not in get_ipython().extension_manager.loaded:
    %load_ext autoreload
    
%autoreload 2

## Local library import
We import all the required local libraries libraries

In [268]:
# Include local library paths
import sys
# sys.path.append('path/to/local/lib') # uncomment and fill to import local libraries

# Import local libraries

# Parameter definition
We set all relevant parameters for our notebook. By convention, parameters are uppercase, while all the 
other variables follow Python's guidelines.


# Data import

## r21ewrttableks101ewladv1_tcm77-290562.xls = dataset2
## nhs-dent-stat-eng-17-18-anx3-ps-prac-edited.csv = dataset1

We retrieve all the required data for the analysis.

# Data processing
Put here the core of the notebook. Feel free di further split this section into subsections.

# References
We report here relevant references:
1. author1, article1, journal1, year1, url1
2. author2, article2, journal2, year2, url2

In [269]:
import xlrd
book = xlrd.open_workbook("dataset2.xls")
print("The number of worksheets is {0}".format(book.nsheets))
print("Worksheet name(s): {0}".format(book.sheet_names()))
sh = book.sheet_by_index(0)
print("{0} {1} {2}".format(sh.name, sh.nrows, sh.ncols))

The number of worksheets is 5
Worksheet name(s): ['Information', 'KS101EW_Numbers', 'KS101EW_Percentages', 'KS101EW_Ranks', 'Metadata']
Information 82 2

In [270]:
dataset2_sheets = {}
for i in book.sheet_names():
    dataset2_sheets[i] = pd.read_excel (r'/Users/zoraizazeem/Documents/PProjects/DataScienceUni/Practical4/dataset2.xls', sheet_name=i)
    dataset2_sheets[i].dropna(axis = 0, how = 'all', inplace = True)

In [271]:
for key, values in dataset2_sheets.items():
    print(key)
    print(values[0:10])

Information
                                           Unnamed: 0 Unnamed: 1
5   2011 Census: Key Statistics for local authorit...        NaN
6                          Published 11 December 2012        NaN
8   This table is part of the 'Key Statistics for ...        NaN
9   to the population estimates from the 2011 Cens...        NaN
11  The release provides all Key Statistics tables...        NaN
12  counties, London boroughs, districts and unita...        NaN
14  Further releases of these Key Statistics and t...        NaN
15  are published in early 2013 for Output Areas a...        NaN
17  This release is in accordance with section 20 ...        NaN
20                                    Confidentiality        NaN
KS101EW_Numbers
                                        Table KS101EW         Unnamed: 1  \
0   2011 Census: Usual resident population, local ...                NaN
2                                   England and Wales                NaN
3   Constituent Countries; Regions, counties, Lond...                NaN
4   authorities and districts in England; unitary ...                NaN
6                                All usual residents                 NaN
9                                           Area code          Area name
10                                                NaN                NaN
11                                                NaN                NaN
13                                          K04000001  ENGLAND AND WALES
15                                          E92000001            ENGLAND

   Unnamed: 2 Unnamed: 3           Unnamed: 4 Unnamed: 5 Unnamed: 6  \
0         NaN        NaN                  NaN        NaN        NaN
2         NaN        NaN                  NaN        NaN        NaN
3         NaN        NaN                  NaN        NaN        NaN
4         NaN        NaN                  NaN        NaN        NaN
6         NaN        NaN                  NaN        NaN        NaN
9         NaN        NaN  All categories: Sex      Males    Females
10        NaN        NaN              Persons    Persons    Persons
11        NaN        NaN               Number     Number     Number
13        NaN        NaN             56075912   27573376   28502536
15        NaN        NaN             53012456   26069148   26943308

              Unnamed: 7                         Unnamed: 8  \
0                    NaN                                NaN
2                    NaN                                NaN
3                    NaN                                NaN
4                    NaN                                NaN
6                    NaN                                NaN
9   Lives in a household  Lives in a communal establishment
10               Persons                            Persons
11                Number                             Number
13              55071113                            1004799
15              52059931                             952525

                                           Unnamed: 9 Unnamed: 10  \
0                                                 NaN         NaN
2                                                 NaN         NaN
3                                                 NaN         NaN
4                                                 NaN         NaN
6                                                 NaN         NaN
9   Schoolchild or full-time student aged 4 and ov...       Area
10                                            Persons    Hectares
11                                             Number      Number
13                                             685206    15101354
15                                             650145    13027843

                      Unnamed: 11
0                             NaN
2                             NaN
3                             NaN
4                             NaN
6                             NaN
9                         Density
10  Number of persons per hectare
11                           Rate
13                            3.7
15                            4.1
KS101EW_Percentages
                                        Table KS101EW         Unnamed: 1  \
0   2011 Census: Usual resident population, local ...                NaN
2                                   England and Wales                NaN
3   Constituent Countries; Regions, counties, Lond...                NaN
4   authorities and districts in England; unitary ...                NaN
6                                All usual residents                 NaN
9                                           Area code          Area name
10                                                NaN                NaN
11                                                NaN                NaN
13                                          K04000001  ENGLAND AND WALES
15                                          E92000001            ENGLAND

   Unnamed: 2 Unnamed: 3           Unnamed: 4  Unnamed: 5  Unnamed: 6  \
0         NaN        NaN                  NaN         NaN         NaN
2         NaN        NaN                  NaN         NaN         NaN
3         NaN        NaN                  NaN         NaN         NaN
4         NaN        NaN                  NaN         NaN         NaN
6         NaN        NaN                  NaN         NaN         NaN
9         NaN        NaN  All categories: Sex       Males     Females
10        NaN        NaN              Persons     Persons     Persons
11        NaN        NaN               Number  Percentage  Percentage
13        NaN        NaN             56075912        49.2        50.8
15        NaN        NaN             53012456        49.2        50.8

              Unnamed: 7                         Unnamed: 8 Unnamed: 9  \
0                    NaN                                NaN        NaN
2                    NaN                                NaN        NaN
3                    NaN                                NaN        NaN
4                    NaN                                NaN        NaN
6                    NaN                                NaN        NaN
9   Lives in a household  Lives in a communal establishment      Area
10               Persons                            Persons   Hectares
11            Percentage                         Percentage     Number
13                  98.2                                1.8   15101354
15                  98.2                                1.8   13027843

                      Unnamed: 10
0                             NaN
2                             NaN
3                             NaN
4                             NaN
6                             NaN
9                         Density
10  Number of persons per hectare
11                           Rate
13                            3.7
15                            4.1
KS101EW_Ranks
                                        Table KS101EW   Unnamed: 1  \
0   2011 Census: Usual resident population, local ...          NaN
2                                   England and Wales          NaN
3   Constituent Countries; Regions, counties, Lond...          NaN
4   authorities and districts in England;  unitary...          NaN
6                                All usual residents           NaN
9                                         Region code  Region name
10                                                NaN          NaN
11                                                NaN          NaN
14                                          E12000001   North East
15                                          E12000001   North East

     Unnamed: 2        Unnamed: 3           Unnamed: 4 Unnamed: 5 Unnamed: 6  \
0           NaN               NaN                  NaN        NaN        NaN
2           NaN               NaN                  NaN        NaN        NaN
3           NaN               NaN                  NaN        NaN        NaN
4           NaN               NaN                  NaN        NaN        NaN
6           NaN               NaN                  NaN        NaN        NaN
9   LAD/UA code       LAD/UA name  All categories: Sex      Males    Females
10          NaN               NaN              Persons    Persons    Persons
11          NaN               NaN               Number      Rank1      Rank1
14    E06000047  County Durham UA               513242        219        130
15    E06000005     Darlington UA               105564        258         91

              Unnamed: 7                         Unnamed: 8  \
0                    NaN                                NaN
2                    NaN                                NaN
3                    NaN                                NaN
4                    NaN                                NaN
6                    NaN                                NaN
9   Lives in a household  Lives in a communal establishment
10               Persons                            Persons
11                 Rank1                              Rank1
14                   286                                 63
15                   154                                195

                                           Unnamed: 9 Unnamed: 10  \
0                                                 NaN         NaN
2                                                 NaN         NaN
3                                                 NaN         NaN
4                                                 NaN         NaN
6                                                 NaN         NaN
9   Schoolchild or full-time student aged 4 and ov...       Area
10                                            Persons    Hectares
11                                              Rank1       Rank1
14                                                 13           9
15                                                258         183

                      Unnamed: 11
0                             NaN
2                             NaN
3                             NaN
4                             NaN
6                             NaN
9                         Density
10  Number of persons per hectare
11                          Rank1
14                            250
15                            178
Metadata
                                         Definitions
0                                               Area
1  Area measurements are Standard Area Measuremen...
2                             Communal establishment
3  A communal establishment is an establishment p...
4                                          Household
5  A household is defined as one person living al...
6                                 Population density
7  Population density is the number of usual resi...
8                       Schoolchildren and students
9  Schoolchildren and students in full-time educa...

In [272]:
dataset1 = pd.read_csv('dataset1.csv', encoding= 'unicode_escape')
# to note unicode_escape allows the code to not break on the existance of a small error

In [273]:
dataset1.head()

,Practice_Code,Practice_Name,LA_CODE,GOR10CD,Age_Band,PSEEN_TOTAL
0,V00003,MISS KM BOLES,E10000032,E12000008,ADULT_24_months,2623
1,V00003,MISS KM BOLES,E10000032,E12000008,CHILD_12_months,801
2,V00004,Woodcroft Dental Practice Ltd,E10000032,E12000008,ADULT_24_months,1960
3,V00004,Woodcroft Dental Practice Ltd,E10000032,E12000008,CHILD_12_months,604
4,V00005,Apex Dental Care Ltd,E10000032,E12000008,ADULT_24_months,8516

In [274]:
(unique_GOR10CD := dataset1.GOR10CD.unique())

array(['E12000008', 'E12000009', 'E12000002', 'E12000007', 'E12000004',
       'E12000005', 'E12000003', 'E12000001', 'E12000006'], dtype=object)

In [275]:
(unique_LA_CODE := dataset1.LA_CODE.unique())

array(['E10000032', 'E10000008', 'E06000042', 'E10000027', 'E10000014',
       'E06000035', 'E08000007', 'E09000010', 'E06000016', 'E06000039',
       'E09000027', 'E08000027', 'E09000030', 'E08000019', 'E06000018',
       'E10000024', 'E06000037', 'E10000025', 'E10000028', 'E08000035',
       'E06000046', 'E08000010', 'E10000016', 'E09000023', 'E08000003',
       'E06000007', 'E06000003', 'E06000002', 'E06000001', 'E10000009',
       'E06000004', 'E08000004', 'E10000018', 'E09000009', 'E10000021',
       'E08000028', 'E09000022', 'E08000025', 'E06000054', 'E06000010',
       'E06000055', 'E08000036', 'E10000031', 'E08000008', 'E10000029',
       'E06000021', 'E06000008', 'E06000047', 'E06000030', 'E09000028',
       'E10000020', 'E10000002', 'E06000014', 'E09000033', 'E09000012',
       'E10000017', 'E10000015', 'E06000032', 'E06000043', 'E10000011',
       'E10000012', 'E09000004', 'E09000003', 'E08000009', 'E08000026',
       'E06000052', 'E08000012', 'E09000018', 'E09000019', 'E06000050',
       'E06000009', 'E09000008', 'E09000006', 'E06000056', 'E10000034',
       'E08000015', 'E06000051', 'E08000018', 'E10000013', 'E06000027',
       'E06000005', 'E08000023', 'E09000005', 'E09000017', 'E09000026',
       'E08000030', 'E08000021', 'E08000024', 'E08000022', 'E08000037',
       'E09000007', 'E06000034', 'E09000011', 'E08000033', 'E10000003',
       'E06000028', 'E06000029', 'E08000032', 'E09000021', 'E10000030',
       'E09000032', 'E06000025', 'E09000015', 'E09000031', 'E08000034',
       'E09000001', 'E10000007', 'E06000057', 'E08000006', 'E09000002',
       'E10000006', 'E08000017', 'E06000020', 'E09000025', 'E06000015',
       'E09000016', 'E06000045', 'E06000041', 'E06000036', 'E06000011',
       'E06000026', 'E06000040', 'E08000016', 'E09000020', 'E10000023',
       'E09000013', 'E09000029', 'E09000024', 'E06000049', 'E09000014',
       'E06000017', 'E06000044', 'E10000019', 'E08000001', 'E06000012',
       'E06000038', 'E08000011', 'E08000013', 'E06000022', 'E06000019',
       'E08000031', 'E08000029', 'E06000031', 'E06000023', 'E06000033',
       'E08000005', 'E06000013', 'E08000014', 'E06000006', 'E08000002',
       'E06000024'], dtype=object)

In [276]:
#source of code : https://stackoverflow.com/questions/38309729/count-unique-values-per-groups-with-pandas/38309823#38309823
(unique_GOR10CD_by_LA_CODE := dataset1.groupby('GOR10CD')['LA_CODE'].nunique())

GOR10CD
E12000001    12
E12000002    23
E12000003    15
E12000004     9
E12000005    14
E12000006    11
E12000007    33
E12000008    19
E12000009    15
Name: LA_CODE, dtype: int64

In [277]:
type(unique_GOR10CD_by_LA_CODE)

pandas.core.series.Series

In [278]:
unique_GOR10CD_by_LA_CODE.sum()

151

In [279]:
len(unique_LA_CODE)

151

there fore data is hierarchical
w/ Geo Code -> LA Code. NO overlap.

In [280]:
(sum_df := dataset1.groupby(['GOR10CD','LA_CODE']).agg({'PSEEN_TOTAL': 'sum'}))
## source of the code: "https://stackoverflow.com/questions/40553002/pandas-group-by-two-columns-to-get-sum-of-another-column"

                     PSEEN_TOTAL
GOR10CD   LA_CODE
E12000001 E06000001        49149
          E06000002        95773
          E06000003        81944
          E06000004       115343
          E06000005        63665
...                          ...
E12000009 E06000054       226079
          E10000008       429960
          E10000009       210837
          E10000013       291023
          E10000027       316320

[151 rows x 1 columns]

In [281]:
dataset2_sheets['KS101EW_Ranks'] = dataset2_sheets['KS101EW_Ranks'][8:-4]

In [282]:
dataset2_sheets['KS101EW_Ranks'] = dataset2_sheets['KS101EW_Ranks'].drop(columns =['Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9','Unnamed: 10', 'Unnamed: 11'])

In [283]:
#dataset2_sheets['KS101EW_Ranks']

In [284]:
dataset2_sheets['KS101EW_Ranks'].rename(columns={"Table KS101EW": "region code", "Unnamed: 1": "region name", "Unnamed: 2":"LACode", "Unnamed: 3":"LAName", "Unnamed: 4":"population"}, inplace=True)

In [285]:
dataset2_sheets['KS101EW_Ranks']

    region code region name     LACode             LAName population
14    E12000001  North East  E06000047   County Durham UA     513242
15    E12000001  North East  E06000005      Darlington UA     105564
16    E12000001  North East  E06000001      Hartlepool UA      92028
17    E12000001  North East  E06000002   Middlesbrough UA     138412
18    E12000001  North East  E06000048  Northumberland UA     316028
..          ...         ...        ...                ...        ...
357   W92000004       Wales  W06000018         Caerphilly     178806
358   W92000004       Wales  W06000019      Blaenau Gwent      69814
359   W92000004       Wales  W06000020            Torfaen      91075
360   W92000004       Wales  W06000021      Monmouthshire      91323
361   W92000004       Wales  W06000022            Newport     145736

[348 rows x 5 columns]

In [286]:
dataset1.drop(columns=['Practice_Name', 'Age_Band'], inplace=True)

In [287]:
dataset1

      Practice_Code    LA_CODE    GOR10CD  PSEEN_TOTAL
0            V00003  E10000032  E12000008         2623
1            V00003  E10000032  E12000008          801
2            V00004  E10000032  E12000008         1960
3            V00004  E10000032  E12000008          604
4            V00005  E10000032  E12000008         8516
...             ...        ...        ...          ...
15348        V45272  E10000025  E12000008          230
15349        V45272  E10000025  E12000008           61
15350        V45272  E10000025  E12000008           92
15351        V45272  E10000025  E12000008          113
15352        V45272  E10000025  E12000008          306

[15353 rows x 4 columns]

In [288]:
df = dataset1.groupby(['Practice_Code', 'LA_CODE', 'GOR10CD'], as_index=False)['PSEEN_TOTAL'].sum()

In [289]:
df

     Practice_Code    LA_CODE    GOR10CD  PSEEN_TOTAL
0           V00003  E10000032  E12000008         3424
1           V00004  E10000032  E12000008         2564
2           V00005  E10000032  E12000008        10425
3           V00006  E10000032  E12000008         3084
4           V00007  E10000032  E12000008         8394
...            ...        ...        ...          ...
7179        V44881  E09000003  E12000007         3418
7180        V45016  E10000017  E12000002         5472
7181        V45094  E10000027  E12000009         1617
7182        V45129  E08000027  E12000005         2055
7183        V45272  E10000025  E12000008         1312

[7184 rows x 4 columns]

In [290]:
to_join2[230:250]

,region code,region name,LACode,LAName,population,Patients Seen
244,E12000008,South East,E06000045,Southampton UA,236882,0
245,E12000008,South East,E06000037,West Berkshire UA,153822,0
246,E12000008,South East,E06000040,Windsor and Maidenhead UA,144560,0
247,E12000008,South East,E06000041,Wokingham UA,154380,0
248,E12000008,South East,E07000004,Aylesbury Vale,174137,0
249,E12000008,South East,E07000005,Chiltern,92635,0
250,E12000008,South East,E07000006,South Bucks,66867,0
251,E12000008,South East,E07000007,Wycombe,171644,0
252,E12000008,South East,E07000061,Eastbourne,99412,0
253,E12000008,South East,E07000062,Hastings,90254,0
254,E12000008,South East,E07000063,Lewes,97502,0
255,E12000008,South East,E07000064,Rother,90588,0
256,E12000008,South East,E07000065,Wealden,148915,0
257,E12000008,South East,E07000084,Basingstoke and Deane,167799,0
258,E12000008,South East,E07000085,East Hampshire,115608,0
259,E12000008,South East,E07000086,Eastleigh,125199,0
260,E12000008,South East,E07000087,Fareham,111581,0
261,E12000008,South East,E07000088,Gosport,82622,0
262,E12000008,South East,E07000089,Hart,91033,0
263,E12000008,South East,E07000090,Havant,120684,0

In [291]:
to_join1

     Practice_Code    LA_CODE    GOR10CD  PSEEN_TOTAL
0           V00003  E10000032  E12000008         3424
1           V00004  E10000032  E12000008         2564
2           V00005  E10000032  E12000008        10425
3           V00006  E10000032  E12000008         3084
4           V00007  E10000032  E12000008         8394
...            ...        ...        ...          ...
7179        V44881  E09000003  E12000007         3418
7180        V45016  E10000017  E12000002         5472
7181        V45094  E10000027  E12000009         1617
7182        V45129  E08000027  E12000005         2055
7183        V45272  E10000025  E12000008         1312

[7184 rows x 4 columns]

In [292]:
to_join2 = dataset2_sheets['KS101EW_Ranks']
to_join1 = df

In [293]:
to_join2['Patients Seen'] = 0

In [295]:
for index, row in to_join1.iterrows():
    a = to_join2.index[to_join2['LACode'] == row['LA_CODE']].tolist()
    if len(a) != 0:
        to_join2.loc[a[0], 'Patients Seen'] += row['PSEEN_TOTAL']

In [296]:
to_join2

,region code,region name,LACode,LAName,population,Patients Seen
14,E12000001,North East,E06000047,County Durham UA,513242,278004
15,E12000001,North East,E06000005,Darlington UA,105564,63665
16,E12000001,North East,E06000001,Hartlepool UA,92028,49149
17,E12000001,North East,E06000002,Middlesbrough UA,138412,95773
18,E12000001,North East,E06000048,Northumberland UA,316028,0
...,...,...,...,...,...,...
357,W92000004,Wales,W06000018,Caerphilly,178806,0
358,W92000004,Wales,W06000019,Blaenau Gwent,69814,0
359,W92000004,Wales,W06000020,Torfaen,91075,0
360,W92000004,Wales,W06000021,Monmouthshire,91323,0
361,W92000004,Wales,W06000022,Newport,145736,0